$(function () {
    var data = {
        "bar": [{
            "id": 0,
            "text": "Фейерверки"
        }, {
            "id": 1,
            "text": "Выбираем ёлки",
            "active": true
        },  {
            "id": 3,
            "text": "Отдыхаем с пользой для здоровья"
        }, {
            "id": 4,
            "text": "Отдыхаем с пользой для ума"
        }, {
            "id": 6,
            "text": "Животные"
        }
        , ],
        "tabs": [{
            "id": 0,
            "content": [{
                "image": {
                    "src": "https://i.imgur.com/wepPVpb.png",
                    "width": 57,
                    "height": 70
                },
                "title": "Как купить фейерверки и хлопушки?",
                "text": "Фейерверки и хлопушки необходимо приобретать в специализированных магазинах или отделах. Вы можете требовать у продавца сертификат соответствия на продукцию. На товаре должна быть понятная инструкция по применению, и МЧС советует внимательно её читать, ведь иногда достаточно отойти на пять метров от фейерверка, а в некоторых случаях это расстояние должно составлять не меньше чем 30 метров. Упаковка пиротехники не должна быть замята, на ней должны отсутствовать увлажнённые места или разрывы."
            }, {
                "image": {
                    "src": "",
                    "width": "",
                    "height": ""
                },
                "title": "Что делать нельзя?",
                "text": "Ни в коем случае нельзя покупать пиротехнику на рынках. Из-за несоблюдения температурных режимов и влажности велик риск, что пиротехника не сработает или взорвётся раньше времени, что может закончиться серьёзными травмами. Взрывать фейерверки, петарды и любую другую пиротехнику вне специальных площадок запрещено."
            }, {
                "image": {
                    "src": "",
                    "width": "",
                    "height": ""
                },
                "title": "Где запускать фейерверки?",
                "text": "Столичное управление МЧС подготовило точки для самостоятельного запуска фейерверков, которые будут доступны и в новогодние праздники. В Минске традиционными площадками для проведения салютов являются площадь Победы, аэропорт Минск-1, стела, район Восточный."
            }]
        }, {
            "id": 1,
            "active": true,
            "content": [{
                "image": {
                    "src": "https://i.imgur.com/8YsN2VF.png",
                    "width": 57,
                    "height": 70
                },
                "title": "Где купить ёлку?",
                "text": "Первые новогодние базары с искусственными елками и декоративными украшениями к Рождеству и Новому году открываются по всей Беларуси. Первыми отсчет до главных праздников 2021-го и наступающего 2022-го года открыли столичные ЦУМ и ГУМ. Соответствующие отделы предусмотрены и постепенно появятся в каждом промышленном магазине страны, а так же на рынках."
            }, {
                "image": {
                    "src": "",
                    "width": "",
                    "height": ""
                },
                "title": "Как правильно выбрать ёлку?",
                "text": "Осмотрите ствол и ветки — главное, чтобы они не были сломаны. Обратите внимание на срез ствола. Если есть кайма тёмного цвета в несколько сантиметров, то такое дерево может долго не простоять. Взгляните на веточки — если деревце срублено недавно, то иголки будут слегка маслянистые. А если их растереть пальцами, сразу почувствуется аромат и липкость смолы. При транспортировке лучше всего обвязать купленное деревце бечёвкой. После покупки пару дней полезно подержать ёлку на балконе, а устанавливать, очистив ствол внизу от коры, лучше всего в ведро с песком. И не забывайте регулярно поливать и опрыскивать хвою."
            }, {
                "image": {
                    "src": "",
                    "width": "",
                    "height": ""
                },
                "title": "Живая или искусственная?",
                "text": "Хотите ли вы до лета выметать иголки? Нет? Обзаведитесь искусственной ёлкой. Да, это красиво и практично, а срок эксплуатации достигает 10–15 лет. Искусственные деревья делают из поливинилхлорида, резины или опрессованной лески. Совет по выбору прост: осмотрите ёлку, проверьте прочность веток и иголок. Также важен запах: не покупайте то, что неприятно пахнет резиной или пластмассой.  Помните, что деревца из ПВХ не горят, однако могут плавиться под воздействием высокой температуры. Не используйте некачественные электрогирлянды, тем более на всю ночь, и не украшайте искусственные ёлки свечками."
            }]
        }, {
            "id": 3,
            "content": [{
                "image": {
                    "src": "https://i.imgur.com/Rn9SNMJ.png",
                    "width": 65,
                    "height": "auto"
                },
                "title": "Где отдыхать?",
                "text": "Итак, если ты ищешь место, где покататься на сноуборде, то Силичи должен быть твой выбор №1. Здесь 4 горнолыжные трассы по 6200-900 метров, а перепад высот самый большой из открытых площадок – 100 метров. С подъемниками на самом популярном белорусском горнолыжном курорте тоже все прекрасно: 4-местные горнолыжные и бугельные к твои услугам. Кроме того, что склоны здесь интереснее, для любителей попрыгать и покрутить трипл корки в «Силичах» есть сноупарк. Кикеры, биг эйры, хаф-пайп и куча джибовых фигур – все это ждет более профессиональных сноубордистов. В «Силичи» хорошо приезжать всей семьей: здесь есть учебно-тренировочный комплекс, где учат кататься на лыжах, а также детская трасса. Кстати, услуги тренера тоже можно заказать. Любителям коньков здесь есть чем заняться – работает крытый каток."
            },
            {
                "image": {
                    "src": "",
                    "width": "",
                    "height": ""
                },
                "title": "Куда сходить на коньки?",
                "text": "Ледовый каток «Раубичи» находится на территории Центра олимпийской подготовки в Раубичах (20 км от Минска). Здесь работает инструктор, оплатив индивидуальные занятия с которым, можно научиться кататься. Доступны прокат и заточка коньков, имеются ресторан, гостиница, бесплатная автостоянка. Не терпится узнать сколько времени осталось до Нового года? Нажимай <a class='advice-info__link' href='https://anastasia180.github.io/time/'>сюда.</a>"
            }]
        }, {
            "id": 4,
            "content": [{
                "image": {
                    "src": "https://i.imgur.com/cqVUkIV.png",
                    "width": 65,
                    "height": "auto"
                },
                "title": "Куда сходить?",
                "text": "Один из самых посещаемых кинотеатров Минска - Беларусь, предлагающий своим посетителям приятный отдых за разумную цену. Кинотеатр состоит из пяти больших залов и предлагает самые актуальные новинки кинематографа. Посетители в своих отзывах отмечают высокий уровень комфорта: удобные кресла с высокими спинками и подлокотниками, большие проходы между рядами, в холле кинотеатра работает кафе-бар, позволяющий перекусить перед сеансом и купить прохладительные напитки или еду с собой."
            }, {
                "image": {
                    "src": "",
                    "width": "",
                    "height": ""
                },
                "title": "Что читать?",
                "text": "Впереди много новогодних праздников. Даже если вы уезжаете на отдых, можно прихватить с собой книжечку, чтобы не скучать в дороге. А если вы дома встречаете, тем более есть прекрасный способ настроиться на праздничный лад. Ведь как приятно, сидеть у камина (пусть даже воображаемого) под лаской плюшевого пледа и читать лучшую рождественскую книгу! Например: «Рождественская песнь в прозе», Чарльз Диккенс"
            },
            {
                "image": {
                    "src": "",
                    "width": "",
                    "height": ""
                },
                "title": "Что слушать?",
                "text": "Достаточно включить определенную мелодию, и ты полностью погружен в атмосферу предстоящего праздника: вокруг летают снежные хлопья, а на окнах красивейшие морозные узоры, которые хочется рассматривать невероятно долго. Все подробности найдёте <a class='advice-info__link' href='https://anastasia180.github.io/mu/'>здесь.</a>"
            }]
        },  {
            "id": 6,
            "content": [{
                "image": {
                    "src": "https://i.imgur.com/NcVSyH6.png",
                    "width": 65,
                    "height": "auto"
                },
                "title": "Как уберечь котов и собак от паники в Новый год?",
                "text": "Шум от фейерверков может заставить ваших домашних любимцев вести себя непредсказуемо. Большинство котов и собак не привыкли к неожиданному шуму и световым вспышкам, поэтому легко впадают в панику. Комитет ветеринарии советует гулять с питомцем до начала пиротехнических шоу. А дома предоставьте ему возможность спрятаться в место, куда не доносится шум, не открывайте окна, занавесьте их. По назначению ветеринара желательно использовать успокоительные препараты, если это требуется животному."
            }, {
                "image": {
                    "src": "",
                    "width": "",
                    "height": ""
                },
                "title": "Как защитить питомца от отравления?",
                "text": "Не стоит подкармливать своего любимца салатами со стола, экзотическими фруктами, жирной пищей. Никакого холодца! Сырокопчёная колбаса — даже если дать всего один кусочек — может привести к тяжёлым поражениям печени, а шоколад — к остановке сердца у котов! Если питомцу всё же стало плохо, первой помощью для него станет голодная диета и энтеросорбент (несколько таблеток активированного угля или смекта). Если у вас дома есть кошка или кот — забудьте о мишуре и серпантине. Искусственную ёлку лучше ставить так, чтобы домашние животные до неё не добрались. Коты, кошки и особенно котята очень любят пожевать ёлочные украшения, что тоже может привести к опасным последствиям."
            }
        ]
        }
    ]
    };
    var classNames = {
        toggle: {
            active: 'advice-bar__item_active'
        },
        tab: {
            visible: 'advice-tabs__tab_visible'
        },
        opener: {
            active: 'advice-bar__opener_active'
        }
    };

    var $document = $(document);
    var $el = $document.find('.js-advice-wrapper');

    var renderBar = function (data) {
        var $parent = $el.find('.js-advice-bar');
        data.forEach(function (item) {
            $('<li/>', {
                class: item.active ? 'advice-bar__item advice-bar__item_active js-advice-toggle' : 'advice-bar__item js-advice-toggle',
                attr: {
                    'data-tab': item.id
                },
                html: '<button class="advice-bar__btn">' + item.text + '</button>'
            }).appendTo($parent);
        });
    };
    var renderTabs = function (data) {
        var $parent = $el.find('.js-advice-tabs');
        data.forEach(function (item) {
            $('<div/>', {
                class: item.active ? 'advice-tabs__tab advice-tabs__tab_visible js-advice-tab' : 'advice-tabs__tab js-advice-tab',
                attr: {
                    'data-tab': item.id
                },
                html: '<ul class="advice-tabs__tab-content js-advice-tab-content">'
            }).appendTo($parent);
            var $tabContent = $el.find('.js-advice-tab').last();
            var $tabContentWrap = $tabContent.find('.js-advice-tab-content');
            item.content.forEach(function (item) {
                $('<li/>', {
                    class: 'advice-tabs__info',
                    html: '<div class="advice-info"><img src="' + item.image.src + '" width=' + item.image.width + ' height=' + item.image.height + ' class="advice-info__img"/><div class="advice-info__content"><h4 class="advice-info__title">' + item.title + '</h4><p class="advice-info__text">' + item.text + '</p></div></div>'
                }).appendTo($tabContentWrap);
            });
        });
    };

    if ($el.length) {
        renderTabs(data.tabs);
        renderBar(data.bar);
        var $bar = $el.find('.js-advice-bar');
        var $toggle = $bar.find('.js-advice-toggle');
        var $opener = $el.find('.js-advice-opener');
        var $tab = $el.find('.js-advice-tab');

        $toggle.on('click', function (e) {
            var $target = $(e.currentTarget);
            var id = $target.data('tab');
            var $targetTab = $tab.filter('[data-tab="' + id + '"]');
            $toggle.removeClass(classNames.toggle.active);
            $tab.removeClass(classNames.tab.visible);
            $target.addClass(classNames.toggle.active);
            $targetTab.addClass(classNames.tab.visible);
            $opener.removeClass(classNames.opener.active);
        });

        $opener.on('click', function (e) {
            var $target = $(e.currentTarget);
            $target.toggleClass(classNames.opener.active);
        });

        $document.on('click', function (e) {
            var $target = $(e.target);
            if (!$target.closest('.js-advice-bar-wrap').length) {
                $opener.removeClass(classNames.opener.active);
            }
        });

        $document.on('keydown', function (e) {
            var ESC = 27;
            if (e.keyCode === ESC) {
                $opener.removeClass(classNames.opener.active);
            }
        });
    }
});